erenkaplan/RFID-KEYPAD-STM32-login-system/Card_Reader/Src/electr/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "i2c-lcd.h"
#include "stm32f1xx_hal.h"
#include "rc522.h"
#include <string.h>
#include <stdio.h>
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define R1_PORT Keypad_R1_GPIO_Port
#define R1_PIN Keypad_R1_Pin
#define R2_PORT Keypad_R2_GPIO_Port
#define R2_PIN Keypad_R2_Pin
#define R3_PORT Keypad_R3_GPIO_Port
#define R3_PIN Keypad_R3_Pin
#define R4_PORT Keypad_R4_GPIO_Port
#define R4_PIN Keypad_R4_Pin
#define C1_PORT Keypad_C1_GPIO_Port
#define C1_PIN Keypad_C1_Pin
#define C2_PORT Keypad_C2_GPIO_Port
#define C2_PIN Keypad_C2_Pin
#define C3_PORT Keypad_C3_GPIO_Port
#define C3_PIN Keypad_C3_Pin

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
I2C_HandleTypeDef hi2c1;

RTC_HandleTypeDef hrtc;

SPI_HandleTypeDef hspi1;

TIM_HandleTypeDef htim4;
TIM_HandleTypeDef htim5;
TIM_HandleTypeDef htim6;
TIM_HandleTypeDef htim7;

UART_HandleTypeDef huart1;

/* USER CODE BEGIN PV */

uint8_t MFRC522_Check(uint8_t* id);
uint8_t MFRC522_Compare(uint8_t* CardID, uint8_t* CompareID);
void MFRC522_WriteRegister(uint8_t addr, uint8_t val);
uint8_t MFRC522_ReadRegister(uint8_t addr);
void MFRC522_SetBitMask(uint8_t reg, uint8_t mask);
void MFRC522_ClearBitMask(uint8_t reg, uint8_t mask);
uint8_t MFRC522_Request(uint8_t reqMode, uint8_t* TagType);
uint8_t MFRC522_ToCard(uint8_t command, uint8_t* sendData, uint8_t sendLen, uint8_t* backData, uint16_t* backLen);
uint8_t MFRC522_Anticoll(uint8_t* serNum);
void MFRC522_CalulateCRC(uint8_t* pIndata, uint8_t len, uint8_t* pOutData);
uint8_t MFRC522_SelectTag(uint8_t* serNum);
uint8_t MFRC522_Auth(uint8_t authMode, uint8_t BlockAddr, uint8_t* Sectorkey, uint8_t* serNum);
uint8_t MFRC522_Read(uint8_t blockAddr, uint8_t* recvData);
uint8_t MFRC522_Write(uint8_t blockAddr, uint8_t* writeData);
void MFRC522_Init(void);
void MFRC522_Reset(void);
void MFRC522_AntennaOn(void);
void MFRC522_AntennaOff(void);
void MFRC522_Halt(void);

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_I2C1_Init(void);
static void MX_SPI1_Init(void);
static void MX_RTC_Init(void);
static void MX_TIM4_Init(void);
static void MX_TIM5_Init(void);
static void MX_TIM6_Init(void);
static void MX_TIM7_Init(void);
static void MX_USART1_UART_Init(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
uint8_t key1_test=0;
uint8_t key1=0;
uint8_t key2=0;
uint8_t birakma_flag1 =1;
uint8_t birakma_flag1_flag =0;
uint8_t buton_Deneme=0;
uint8_t ekranayazma(uint8_t datacevir);

uint8_t sifre[]={2,5,8,0,9,6};
uint8_t sifre_lenght=(sizeof(sifre)/sizeof(uint8_t));
uint8_t sifre_test[15];
uint8_t girilentus=0;
uint8_t sifrebitir=0;

void open_door (void);
void close_door(void);
void right_pasword(void);
void wrong_pasword(void);
char read_keypad (void);

uint8_t rfid_flag=1;
unsigned char CardID[5];

RTC_TimeTypeDef sTime;
RTC_DateTypeDef DateToUpdate;

uint16_t gun,ay,yil,saat,dakika,saniye;
char Time_buffer[8];
char line1_buffer[16];
char usart_buffer[50];
uint8_t usart_buffer1[50];

struct kullanici{
unsigned char RFID[5];
char Name[15];
char Surname[15];
char Time[8];
};

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */
struct kullanici kimlik1;
struct kullanici kimlik2;
struct kullanici kimlik3;
struct kullanici kimlik4;
struct kullanici kimlik5;
	
kimlik1.RFID[0]=0x31;
kimlik1.RFID[1]=0x6F;
kimlik1.RFID[2]=0x44;
kimlik1.RFID[3]=0x35;
kimlik1.RFID[4]=0x2F;
strcpy(kimlik1.Name,"Tolga");
strcpy(kimlik1.Surname , "Kocasari");
	
kimlik2.RFID[0]=0x26;
kimlik2.RFID[1]=0x0C;
kimlik2.RFID[2]=0xFF;
kimlik2.RFID[3]=0x64;
kimlik2.RFID[4]=0x9C;
strcpy(kimlik2.Name,"Huseyin");
strcpy(kimlik2.Surname , "Batmaz");

kimlik3.RFID[0]=0x88;
kimlik3.RFID[1]=0x04;
kimlik3.RFID[2]=0x56;
kimlik3.RFID[3]=0x8F;
kimlik3.RFID[4]=0x55;
strcpy(kimlik3.Name,"Gokay");
strcpy(kimlik3.Surname , "Yildirim");

kimlik4.RFID[0]=0x19;
kimlik4.RFID[1]=0xE0;
kimlik4.RFID[2]=0x96;
kimlik4.RFID[3]=0x98;
kimlik4.RFID[4]=0xF7;
strcpy(kimlik4.Name,"Guest");
strcpy(kimlik4.Surname , "Card1267");

kimlik5.RFID[0]=0xC9;
kimlik5.RFID[1]=0xCD;
kimlik5.RFID[2]=0x5F;
kimlik5.RFID[3]=0x98;
kimlik5.RFID[4]=0xC3;
strcpy(kimlik5.Name,"Guest");
strcpy(kimlik5.Surname , "Card5811");

  /* USER CODE END 1 */
  

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

