erenkaplan/RFID-KEYPAD-STM32-login-system/Card_Reader/Src/electr/main.c
  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_I2C1_Init();
  MX_SPI1_Init();
  MX_RTC_Init();
  MX_TIM4_Init();
  MX_TIM5_Init();
  MX_TIM6_Init();
  MX_TIM7_Init();
  MX_USART1_UART_Init();
  /* USER CODE BEGIN 2 */
	MFRC522_Init();
  lcd_init();
	HAL_TIM_Base_Start_IT(&htim4);
  HAL_TIM_Base_Start_IT(&htim5);
	HAL_TIM_Base_Start_IT(&htim7);
	HAL_TIM_Base_Start_IT(&htim6);
	HAL_TIM_Base_Stop(&htim4);
	HAL_TIM_Base_Stop(&htim5);
	HAL_TIM_Base_Stop(&htim7);
	HAL_TIM_Base_Stop(&htim6);
	
  lcd_send_cmd (0x80|0x00);
  lcd_send_string("Password or Card");
	
	lcd_send_cmd (0x80|0x40);
  lcd_send_string("PW:");
	
	HAL_GPIO_WritePin(GPIOB,GPIO_PIN_11,GPIO_PIN_SET);
	
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
		
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
if (MFRC522_Check(CardID) == MI_OK) 
	{   
				
	if (MFRC522_Compare(CardID, kimlik1.RFID) == MI_OK && rfid_flag==1)
		{ 
						
	HAL_RTC_GetTime(&hrtc, &sTime, RTC_FORMAT_BIN);
	HAL_RTC_GetDate(&hrtc, &DateToUpdate, RTC_FORMAT_BIN);
						
	sprintf(Time_buffer,"%2d/%2d/%2d",sTime.Hours,sTime.Minutes,sTime.Seconds);
  strcpy(kimlik1.Time,Time_buffer);
	          
	sprintf(line1_buffer,"%s %s",kimlik1.Name,kimlik1.Surname);
	lcd_send_cmd (0x80|0x00);
  lcd_send_string("                ");
	lcd_send_cmd (0x80|0x00);
  lcd_send_string(line1_buffer);
	lcd_send_cmd (0x80|0x40);
  lcd_send_string("                ");
	lcd_send_cmd (0x80|0x40);
  lcd_send_string("    WELCOME");
			
	sprintf(usart_buffer,"%s %s %s\n",kimlik1.Time,kimlik1.Name,kimlik1.Surname);
	for(int i=0;i<=sizeof(usart_buffer);i++){
	usart_buffer1[i]=usart_buffer[i];
	}
  HAL_UART_Transmit(&huart1,usart_buffer1,sizeof(usart_buffer),100);
	
	rfid_flag=0;
	open_door();
	}
else if(MFRC522_Compare(CardID, kimlik2.RFID) == MI_OK && rfid_flag==1)
{
	HAL_RTC_GetTime(&hrtc, &sTime, RTC_FORMAT_BIN);
  HAL_RTC_GetDate(&hrtc, &DateToUpdate, RTC_FORMAT_BIN);
						
	sprintf(Time_buffer,"%2d/%2d/%2d",sTime.Hours,sTime.Minutes,sTime.Seconds);
	strcpy(kimlik2.Time,Time_buffer);	
	sprintf(line1_buffer,"%s %s",kimlik2.Name,kimlik2.Surname);
	lcd_send_cmd (0x80|0x00);
  lcd_send_string("                ");
	lcd_send_cmd (0x80|0x00);
  lcd_send_string(line1_buffer);
	lcd_send_cmd (0x80|0x40);
  lcd_send_string("                ");
	lcd_send_cmd (0x80|0x40);
  lcd_send_string("    WELCOME");	
 
		sprintf(usart_buffer,"%s %s %s\n",kimlik2.Time,kimlik2.Name,kimlik2.Surname);
	for(int i=0;i<=sizeof(usart_buffer);i++){
	usart_buffer1[i]=usart_buffer[i];
	}
  HAL_UART_Transmit(&huart1,usart_buffer1,sizeof(usart_buffer),100);

	rfid_flag=0;
	open_door();
		}
else if(MFRC522_Compare(CardID, kimlik3.RFID) == MI_OK && rfid_flag==1)
	{ 
	HAL_RTC_GetTime(&hrtc, &sTime, RTC_FORMAT_BIN);
  HAL_RTC_GetDate(&hrtc, &DateToUpdate, RTC_FORMAT_BIN);
	sprintf(Time_buffer,"%2d/%2d/%2d",sTime.Hours,sTime.Minutes,sTime.Seconds);
	strcpy(kimlik3.Time,Time_buffer);
	sprintf(line1_buffer,"%s %s",kimlik3.Name,kimlik3.Surname);
	lcd_send_cmd (0x80|0x00);
  lcd_send_string("                ");
	lcd_send_cmd (0x80|0x00);
  lcd_send_string(line1_buffer);
	lcd_send_cmd (0x80|0x40);
  lcd_send_string("                ");
	lcd_send_cmd (0x80|0x40);
  lcd_send_string("    WELCOME");
  
			sprintf(usart_buffer,"%s %s %s\n",kimlik3.Time,kimlik3.Name,kimlik3.Surname);
	for(int i=0;i<=sizeof(usart_buffer);i++){
	usart_buffer1[i]=usart_buffer[i];
	}
  HAL_UART_Transmit(&huart1,usart_buffer1,sizeof(usart_buffer),100);
		
		rfid_flag=0;
	open_door();
	}
else if(MFRC522_Compare(CardID, kimlik4.RFID) == MI_OK && rfid_flag==1)
	{  
	HAL_RTC_GetTime(&hrtc, &sTime, RTC_FORMAT_BIN);
  HAL_RTC_GetDate(&hrtc, &DateToUpdate, RTC_FORMAT_BIN);
	sprintf(Time_buffer,"%2d/%2d/%2d",sTime.Hours,sTime.Minutes,sTime.Seconds);
	strcpy(kimlik4.Time,Time_buffer);
	sprintf(line1_buffer,"%s %s",kimlik4.Name,kimlik4.Surname);
	lcd_send_cmd (0x80|0x00);
  lcd_send_string("                ");
	lcd_send_cmd (0x80|0x00);
  lcd_send_string(line1_buffer);
	lcd_send_cmd (0x80|0x40);
  lcd_send_string("                ");
	lcd_send_cmd (0x80|0x40);
  lcd_send_string("    WELCOME");
	
			sprintf(usart_buffer,"%s %s %s\n",kimlik4.Time,kimlik4.Name,kimlik4.Surname);
	for(int i=0;i<=sizeof(usart_buffer);i++){
	usart_buffer1[i]=usart_buffer[i];
	}
  HAL_UART_Transmit(&huart1,usart_buffer1,sizeof(usart_buffer),100);
		
		rfid_flag=0;
	open_door();
	}
else if(MFRC522_Compare(CardID, kimlik5.RFID) == MI_OK && rfid_flag==1)
	{ 
	HAL_RTC_GetTime(&hrtc, &sTime, RTC_FORMAT_BIN);
	HAL_RTC_GetDate(&hrtc, &DateToUpdate, RTC_FORMAT_BIN);
	sprintf(Time_buffer,"%2d/%2d/%2d",sTime.Hours,sTime.Minutes,sTime.Seconds);
	strcpy(kimlik5.Time,Time_buffer);
	sprintf(line1_buffer,"%s %s",kimlik5.Name,kimlik5.Surname);
	lcd_send_cmd (0x80|0x00);
  lcd_send_string("                ");
	lcd_send_cmd (0x80|0x00);
  lcd_send_string(line1_buffer);
	lcd_send_cmd (0x80|0x40);
  lcd_send_string("                ");
	lcd_send_cmd (0x80|0x40);
  lcd_send_string("    WELCOME");
	
			sprintf(usart_buffer,"%s %s %s\n",kimlik5.Time,kimlik5.Name,kimlik5.Surname);
	for(int i=0;i<=sizeof(usart_buffer);i++){
	usart_buffer1[i]=usart_buffer[i];
	}
  HAL_UART_Transmit(&huart1,usart_buffer1,sizeof(usart_buffer),100);
		
		rfid_flag=0;
	open_door();
	}
else if  (rfid_flag==1) 
	{
	rfid_flag=0;
	lcd_send_cmd (0x80|0x00);
  lcd_send_string("                ");
	lcd_send_cmd (0x80|0x00);	
  lcd_send_string(" Undefined Card");
	close_door();
	lcd_send_cmd (0x80|0x40);
  lcd_send_string("                ");	
	HAL_TIM_Base_Start(&htim6);
	HAL_TIM_Base_Stop(&htim5);
	}
		}
if(CardID[0]== 0x00){
	rfid_flag=1;
		}
  HAL_Delay(1);
										 
		//2.  KOD				 
						 
	key1_test=read_keypad();   //tus birakma kontrol
if(key1_test!=0x00 && birakma_flag1_flag == 0){
	HAL_TIM_Base_Start(&htim4);
	HAL_GPIO_WritePin(buzzer_GPIO_Port,buzzer_Pin,GPIO_PIN_SET);
	birakma_flag1_flag =1;
		}
if(birakma_flag1 == 0 && key1_test == 0x00){
	birakma_flag1=1;
	buton_Deneme=1;
	birakma_flag1_flag = 0;
		}
if(key1_test != 0x00 ){
	key1=key1_test;
	key2=ekranayazma(key1);
		}
if(birakma_flag1==1 && key1 == 11 && buton_Deneme == 1)
		{
	buton_Deneme=0;
if(girilentus !=0){
	girilentus--;
		}
for(int i=girilentus; i<=14; i++)
{
	sifre_test[i]=0;
		}
	lcd_send_cmd (0x80|0x44+girilentus);
  lcd_send_string("  ");
	  }
if(birakma_flag1==1 && key1 == 12 && buton_Deneme == 1)
		{
	sifrebitir=1;
		}		
if(birakma_flag1==1 && buton_Deneme == 1){
	buton_Deneme=0;
if(key1 == 10 || key1 == 1 || key1 == 2|| key1 == 3 || key1 == 4 || key1 == 5|| key1 == 6 || key1 == 7 || key1 == 8 || key1 == 9){
	sifre_test[girilentus]=key1%10;
	girilentus++;
if(girilentus==1){
	lcd_send_cmd (0x80|0x40);
	lcd_send_string("PW:               ");
		}
	lcd_send_cmd (0x80|0x43+girilentus);
  lcd_send_data(ekranayazma(sifre_test[girilentus-1]));
		}
if(sifrebitir==1){
	sifrebitir=0;
 if(girilentus !=sifre_lenght)
		{
	girilentus=0;
	wrong_pasword();
for(int k=0; k<=14;k++){
	sifre_test[k]=0;
		}
		 }
 else
		{ 
	girilentus=0;
for(int i=0;i<=sifre_lenght-1;i++){
	if(sifre[i]!=sifre_test[i]){
	wrong_pasword();
for(int k=0; k<=14;k++){
	sifre_test[k]=0;
		}
	i=100;
		}
if(i==sifre_lenght-1){
	right_pasword();
for(int k=0; k<=14;k++){
	sifre_test[k]=0;
			}
				}
					}
				    }
		         	}
		            }		
                 }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};
  RCC_PeriphCLKInitTypeDef PeriphClkInit = {0};

  /** Initializes the CPU, AHB and APB busses clocks 
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_LSI|RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.HSEPredivValue = RCC_HSE_PREDIV_DIV1;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.LSIState = RCC_LSI_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL9;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }
  /** Initializes the CPU, AHB and APB busses clocks 
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
  {
    Error_Handler();
  }
  PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_RTC;
  PeriphClkInit.RTCClockSelection = RCC_RTCCLKSOURCE_LSI;
  if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief I2C1 Initialization Function
  * @param None
  * @retval None
  */
static void MX_I2C1_Init(void)
{

  /* USER CODE BEGIN I2C1_Init 0 */

  /* USER CODE END I2C1_Init 0 */

