erenkaplan/RFID-KEYPAD-STM32-login-system/Card_Reader/Src/electr/main.c
  /* USER CODE BEGIN TIM7_Init 0 */
  /* USER CODE END TIM7_Init 0 */

  TIM_MasterConfigTypeDef sMasterConfig = {0};

  /* USER CODE BEGIN TIM7_Init 1 */
  /* USER CODE END TIM7_Init 1 */
  htim7.Instance = TIM7;
  htim7.Init.Prescaler = 7200;
  htim7.Init.CounterMode = TIM_COUNTERMODE_UP;
  htim7.Init.Period = 12000;
  htim7.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
  if (HAL_TIM_Base_Init(&htim7) != HAL_OK)
  {
    Error_Handler();
  }
  sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
  sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
  if (HAL_TIMEx_MasterConfigSynchronization(&htim7, &sMasterConfig) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN TIM7_Init 2 */

  /* USER CODE END TIM7_Init 2 */

}

/**
  * @brief USART1 Initialization Function
  * @param None
  * @retval None
  */
static void MX_USART1_UART_Init(void)
{

  /* USER CODE BEGIN USART1_Init 0 */

  /* USER CODE END USART1_Init 0 */

  /* USER CODE BEGIN USART1_Init 1 */

  /* USER CODE END USART1_Init 1 */
  huart1.Instance = USART1;
  huart1.Init.BaudRate = 9600;
  huart1.Init.WordLength = UART_WORDLENGTH_8B;
  huart1.Init.StopBits = UART_STOPBITS_1;
  huart1.Init.Parity = UART_PARITY_NONE;
  huart1.Init.Mode = UART_MODE_TX_RX;
  huart1.Init.HwFlowCtl = UART_HWCONTROL_NONE;
  huart1.Init.OverSampling = UART_OVERSAMPLING_16;
  if (HAL_UART_Init(&huart1) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN USART1_Init 2 */

  /* USER CODE END USART1_Init 2 */

}

/**
  * @brief GPIO Initialization Function
  * @param None
  * @retval None
  */
static void MX_GPIO_Init(void)
{
  GPIO_InitTypeDef GPIO_InitStruct = {0};

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOD_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();
  __HAL_RCC_GPIOC_CLK_ENABLE();

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOB, buzzer_Pin|GPIO_PIN_11|Keypad_R1_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOC, Keypad_R2_Pin|Keypad_R3_Pin|Keypad_R4_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin : PA4 */
  GPIO_InitStruct.Pin = GPIO_PIN_4;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /*Configure GPIO pin : buzzer_Pin */
  GPIO_InitStruct.Pin = buzzer_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_PULLDOWN;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(buzzer_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : PB11 */
  GPIO_InitStruct.Pin = GPIO_PIN_11;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

  /*Configure GPIO pin : Keypad_R1_Pin */
  GPIO_InitStruct.Pin = Keypad_R1_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
  HAL_GPIO_Init(Keypad_R1_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : Keypad_R2_Pin Keypad_R3_Pin Keypad_R4_Pin */
  GPIO_InitStruct.Pin = Keypad_R2_Pin|Keypad_R3_Pin|Keypad_R4_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

  /*Configure GPIO pin : Keypad_C1_Pin */
  GPIO_InitStruct.Pin = Keypad_C1_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  HAL_GPIO_Init(Keypad_C1_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : Keypad_C2_Pin Keypad_C3_Pin */
  GPIO_InitStruct.Pin = Keypad_C2_Pin|Keypad_C3_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

}

/* USER CODE BEGIN 4 */
void right_pasword(void){
	HAL_GPIO_WritePin(GPIOB,GPIO_PIN_11,GPIO_PIN_RESET);

  lcd_send_cmd (0x80|0x00);
  lcd_send_string("                ");
	lcd_send_cmd (0x80|0x00);
  lcd_send_string("Correct Password");
	lcd_send_cmd (0x80|0x40);
  lcd_send_string("                ");
	HAL_GPIO_WritePin(buzzer_GPIO_Port,buzzer_Pin,GPIO_PIN_SET);
	HAL_TIM_Base_Start(&htim6);
  HAL_TIM_Base_Start(&htim5);
	
	HAL_RTC_GetTime(&hrtc, &sTime, RTC_FORMAT_BIN);
	
	sprintf(usart_buffer,"%2d/%2d/%2d Correct Pasword\n",sTime.Hours,sTime.Minutes,sTime.Seconds);
	for(int i=0;i<=sizeof(usart_buffer);i++){
	usart_buffer1[i]=usart_buffer[i];
	}
  HAL_UART_Transmit(&huart1,usart_buffer1,sizeof(usart_buffer),100);
}
void wrong_pasword(void){
	HAL_GPIO_WritePin(GPIOB,GPIO_PIN_11,GPIO_PIN_SET);
	
	lcd_send_cmd (0x80|0x00);
  lcd_send_string("                ");
	lcd_send_cmd (0x80|0x00);
  lcd_send_string(" Wrong Password");
	lcd_send_cmd (0x80|0x40);
  lcd_send_string("                ");
	
	HAL_TIM_Base_Start(&htim7);
	HAL_TIM_Base_Start(&htim6);
	HAL_GPIO_WritePin(buzzer_GPIO_Port,buzzer_Pin,GPIO_PIN_SET);
	
	HAL_RTC_GetTime(&hrtc, &sTime, RTC_FORMAT_BIN);
	HAL_RTC_GetDate(&hrtc, &DateToUpdate, RTC_FORMAT_BIN);
	sprintf(usart_buffer,"%2d/%2d/%2d Wrong Pasword\n",sTime.Hours,sTime.Minutes,sTime.Seconds);
	for(int i=0;i<=sizeof(usart_buffer);i++){
	usart_buffer1[i]=usart_buffer[i];
	}
  HAL_UART_Transmit(&huart1,usart_buffer1,sizeof(usart_buffer),100);
}
void open_door (void){
	HAL_TIM_Base_Start(&htim6);
  HAL_GPIO_WritePin(GPIOB,GPIO_PIN_11,GPIO_PIN_RESET);

	HAL_TIM_Base_Start(&htim5);
	HAL_GPIO_WritePin(buzzer_GPIO_Port,buzzer_Pin,GPIO_PIN_SET);
	
	for(int i=0; i<=14; i++)
	{
	 sifre_test[i]=0;
	}
	girilentus=0;
}

void close_door(void){
	
HAL_GPIO_WritePin(GPIOB,GPIO_PIN_11,GPIO_PIN_SET);
HAL_TIM_Base_Start(&htim7);
HAL_GPIO_WritePin(buzzer_GPIO_Port,buzzer_Pin,GPIO_PIN_SET);
	
							
	HAL_RTC_GetTime(&hrtc, &sTime, RTC_FORMAT_BIN);
	HAL_RTC_GetDate(&hrtc, &DateToUpdate, RTC_FORMAT_BIN);
	sprintf(usart_buffer,"%2d/%2d/%2d Undefined Card\n",sTime.Hours,sTime.Minutes,sTime.Seconds);
	for(int i=0;i<=sizeof(usart_buffer);i++){
	usart_buffer1[i]=usart_buffer[i];
	}
  HAL_UART_Transmit(&huart1,usart_buffer1,sizeof(usart_buffer),100);
	for(int i=0; i<=14; i++)
	{
	sifre_test[i]=0;
	}
	girilentus=0;
}
uint8_t ekranayazma(uint8_t datacevir){

if(datacevir==1){
return '1';
}
if(datacevir==2){
return '2';
}
if(datacevir==3){
return '3';
}
	if(datacevir==4){
return '4';
}
	if(datacevir==5){
return '5';
}
	if(datacevir==6){
return '6';
}
	if(datacevir==7){
return '7';
}
	if(datacevir==8){
return '8';
}
	if(datacevir==9){
return '9';
}
	if(datacevir==0){
return '0';
}
	else
	{
	return 0;
	}
}

char read_keypad (void)
	{
	/* Make ROW 1 LOW and all other ROWs HIGH */
	HAL_GPIO_WritePin (R1_PORT, R1_PIN, GPIO_PIN_RESET);  //Pull the R1 low
	HAL_GPIO_WritePin (R2_PORT, R2_PIN, GPIO_PIN_SET);  // Pull the R2 High
	HAL_GPIO_WritePin (R3_PORT, R3_PIN, GPIO_PIN_SET);  // Pull the R3 High
	HAL_GPIO_WritePin (R4_PORT, R4_PIN, GPIO_PIN_SET);  // Pull the R4 High
	
	if (!(HAL_GPIO_ReadPin (C1_PORT, C1_PIN)))   // if the Col 1 is low
	{
		birakma_flag1=0;
		return 1;
	}
	
